STMicroelectronics/STM32CubeG4/Projects/B-G474E-DPOW1/Applications/Digital_Power/Buck_CurrentMode_SW/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file         main.c
  * @author       STMicroelectronics
  * @brief        Main program body
  * @details      This file provides main function and peripheral init 
                  functions
  ******************************************************************************
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file in
  * the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  ******************************************************************************
  *
 * @history Date       Version Person  Change
 * @history ---------- ------- ------- ----------------------------------------
  * @history 2020-02-14 1.0     PBo     Created with the support of Biricha Digital Power LTd
  * @history 2022-01-04 1.0     RGo     Header modifications
  * @history 2022-01-10 2.0     NSa     Moved Systick_Handler to ISR file and Load_Handler to 
  *                                     app code file
 */

/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32g4xx_it.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
//#define RUN_OPEN_LOOP
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

COMP_HandleTypeDef hcomp6;

DAC_HandleTypeDef hdac4;

FMAC_HandleTypeDef hfmac;

HRTIM_HandleTypeDef hhrtim1;

OPAMP_HandleTypeDef hopamp5;

RTC_HandleTypeDef hrtc;

/* USER CODE BEGIN PV */
float Vdrop = SLOPE_VPP;
float Vdrop_old = 0.0;
extern G4_Demo_t Demo;
extern WAVEFORM_DISPLAY_INFO_t Waveform;

int16_t bTransient = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_RTC_Init(void);
static void MX_ADC1_Init(void);
static void MX_HRTIM1_Init(void);
static void MX_FMAC_Init(void);
static void MX_COMP6_Init(void);
static void MX_DAC4_Init(void);
static void MX_OPAMP5_Init(void);
/* USER CODE BEGIN PFP */
extern uint16_t HAL_HRTIM_NsToTicks(HRTIM_HandleTypeDef *hhrtim, uint32_t Timers, int ns);
extern uint16_t HAL_HRTIM_FreqToTicks(HRTIM_HandleTypeDef *hhrtim, uint32_t Timers, int FreqHz);
extern uint16_t HAL_HRTIM_DeadBandNsToTicks(int ns);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/**
  * @brief This set the slope for the DAC.
  * @details
  * The sets the total drop across the PWM period required.
  * We use DAC1 channel 1&2 since channel 1 is connected to the external pin
  * but channel 2 is actually used for the controller.
  */
void SetRamp( float SlopeV )
{
  uint16_t update;
  float stepV;
  uint16_t step;
  uint16_t NumUpdates = 75; // Max updates per period is determiend by the max update rate of the DAC
  
  update = Demo.periodBuck / NumUpdates;
  stepV = SlopeV/NumUpdates;
  
  /* DacDrop = (Vdrop * 4096*16(fractional)/3.3V) */
  step = (uint16_t)((stepV * DAC_MAX * 16)/3.3);
  
  /* Update the sawtooth waveform generator with the required step size */
  LL_DAC_SetWaveSawtoothStepData(DAC4, LL_DAC_CHANNEL_2, step);
  __HAL_HRTIM_SETCOMPARE( &hhrtim1, HRTIM_TIMERINDEX_TIMER_C, HRTIM_COMPAREUNIT_2, update);
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_RTC_Init();
  MX_ADC1_Init();
  MX_HRTIM1_Init();
  MX_FMAC_Init();
  MX_COMP6_Init();
  MX_DAC4_Init();
  MX_OPAMP5_Init();
  /* USER CODE BEGIN 2 */

  /* Initialise 3P3Z controller with our 2P2Z coeffs, REF and ADC value */
  CNTRL_3p3zFloatInit(&Demo.CtrlFloat, B0, B1, B2, 0.0,
                      A1, A2, 0.0, K,
                      REF, 0, DAC_MAX );    
  
  /* Perform an ADC automatic self-calibration and enable ADC */
  if (HAL_ADCEx_Calibration_Start(&hadc1, ADC_SINGLE_ENDED) != HAL_OK)
  {
    /* Configuration Error */
    Error_Handler();
  }

#ifndef RUN_OPEN_LOOP
  /* Start the ADC and enable the end of conversion interrupt */
  if (HAL_ADC_Start_IT(&hadc1) != HAL_OK)
  {
    /* Configuration Error */
    Error_Handler();
  }  
#endif


  /* Enables DAC and starts conversion of the channel */
  if (HAL_DAC_Start(&hdac4, DAC_CHANNEL_2) != HAL_OK)
  {
    /* Configuration Error */
    Error_Handler();
  }
  
  /* Start the comparator to detect the peak current trip threshold */
  if (HAL_COMP_Start(&hcomp6) != HAL_OK)
  {
    /* Configuration Error */
    Error_Handler();
  }

#ifndef RUN_OPEN_LOOP
  /* Start the OPAMP which allows us to view the demand peak current value on the scope */
  if (HAL_OPAMP_Start(&hopamp5) != HAL_OK)
  {
    /* Configuration Error */
    Error_Handler();
  }  
#endif  
  /* Calculate PWM period and update timer register */
  Demo.periodBuck = HAL_HRTIM_FreqToTicks(&hhrtim1, HRTIM_TIMERINDEX_TIMER_C, SwitchFreq);
  __HAL_HRTIM_SETPERIOD(&hhrtim1, HRTIM_TIMERINDEX_TIMER_C, Demo.periodBuck);
  
#ifdef RUN_OPEN_LOOP  
  /* Open loop so run with a small fixed 10% cycle */
  __HAL_HRTIM_SETCOMPARE(&hhrtim1, HRTIM_TIMERINDEX_TIMER_C, HRTIM_COMPAREUNIT_1, Demo.periodBuck * 10 / 100);
#else
  /* Set max duty to 80% of period */
  __HAL_HRTIM_SETCOMPARE(&hhrtim1, HRTIM_TIMERINDEX_TIMER_C, HRTIM_COMPAREUNIT_1, Demo.periodBuck * 80 / 100);
#endif 
  /* Set number of slope compensation steps per period to 75 */
  __HAL_HRTIM_SETCOMPARE(&hhrtim1, HRTIM_TIMERINDEX_TIMER_C, HRTIM_COMPAREUNIT_2, Demo.periodBuck / 75);
  /* Set blanking period */
  __HAL_HRTIM_SETCOMPARE(&hhrtim1, HRTIM_TIMERINDEX_TIMER_C, HRTIM_COMPAREUNIT_3, HAL_HRTIM_NsToTicks(&hhrtim1, HRTIM_TIMERINDEX_TIMER_C,500)); // Allow 300ns for blanking + 200ns for rising edge delay
  /* Set PWM rising edge to 200ns after the start of the period */
  __HAL_HRTIM_SETCOMPARE(&hhrtim1, HRTIM_TIMERINDEX_TIMER_C, HRTIM_COMPAREUNIT_4, HAL_HRTIM_NsToTicks(&hhrtim1, HRTIM_TIMERINDEX_TIMER_C,200)); //200ns after start of period

  
  /* Start the PWMs */
  HAL_HRTIM_WaveformOutputStart(&hhrtim1, HRTIM_OUTPUT_TC1 | HRTIM_OUTPUT_TC2); // Enable output
  HAL_HRTIM_WaveformCounterStart(&hhrtim1, HRTIM_TIMERID_TIMER_C); // Enable counter

  /* Enable T6 for Buck only mode usage */
  HAL_GPIO_WritePin(GPIOB, BUCKBOOST_P2_DRIVE_Pin, GPIO_PIN_SET);
  
